Autodesk.Revit.DB.Plane.#ctor(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Construct a Plane object from a normal and an origin represented as XYZ objects. Follows the standard conventions for a planar surface.
The constructed Plane object will pass through origin and be perpendicular to normal. The X and Y axes of the plane will be defined arbitrarily.
norm:
Plane normal.
origin:
Plane origin.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Plane.#ctor(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Construct a Plane object from X and Y axes and an origin represented as XYZ objects. The plane passes through "origin" and is spanned by the basis vectors "xVec" and "yVec".
xVec:
X axis of the resulting Plane object.
yVec:
Y axis of the resulting Plane object.
origin:
Origin of the resulting Plane object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Plane
A Planar surface.
Since:
2016